2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/HF-wijzigingGeslachtsnaam-TC01-2-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670024</ABONNEMENT>
            <NAAM>Mutaties op geselecteerde personen van wie u de bijhoudingspartij heeft id 347</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op geselecteerde personen van wie u de bijhoudingspartij heeft id 347</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>02001</brp:code>
    <brp:naam>Wijziging geslachtsnaam</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>017401</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:samengesteldeNaam brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">*</brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:geslachtsaanduiding>
        <brp:voornamen>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
          <brp:voornaam brp:objecttype="PersoonVoornaam" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">*</brp:voornaam>
        </brp:voornamen>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:voorvoegsel>de</brp:voorvoegsel>
            <brp:scheidingsteken> </brp:scheidingsteken>
            <brp:stam>Wijziging</brp:stam>
          </brp:geslachtsnaamcomponent>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumEindeGeldigheid>2013-01-01</brp:datumEindeGeldigheid>
            <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:stam>Vlag</brp:stam>
          </brp:geslachtsnaamcomponent>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:stam>Vlag</brp:stam>
          </brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:naamgebruik brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>